DL8NCI/stm32f411re_test_300/Test300/Inc/DataAquisition.h
/*
 * Aquisition.h
 *
 *  Created on: 17.06.2017
 *      Author: DL8NCI
 */

#ifndef DATAAQUISITION_H_
#define DATAAQUISITION_H_


#include "stm32f4xx_hal.h"
#include  <sys/unistd.h>
#include "Statistics.h"


#define HIH8000_ST_NORMAL_OPERATION 0;
#define HIH8000_ST_STALE_DATA 1;
#define HIH8000_ST_COMMAND_MODE 2;


typedef struct TDAQU_HIH8000_result {
	uint8_t status;
	uint16_t humidity;
	uint16_t temperature;
	};

HAL_StatusTypeDef DAQU_startADC(ADC_HandleTypeDef* hadc, uint16_t n_iter, uint8_t n_chan, TStat *st);
void DAQU_printResult();
void DAQU_printErrorInfo(HAL_StatusTypeDef rc);

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc);
void HAL_ADC_ErrorCallback(ADC_HandleTypeDef *hadc);

HAL_StatusTypeDef DAQU_start_HIH8000(I2C_HandleTypeDef *hi2c);
HAL_StatusTypeDef DAQU_read_HIH8000(I2C_HandleTypeDef *hi2c, struct TDAQU_HIH8000_result *r);
double DAQU_HIH8000_get_RelativeHumidity(struct TDAQU_HIH8000_result *r);
double DAQU_HIH8000_get_Temperature(struct TDAQU_HIH8000_result *r);
double DAQU_HIH8000_getDewPointTemperature(struct TDAQU_HIH8000_result *r);


void DAQU_TIM_dumpRegisters(TIM_HandleTypeDef *htim);


#endif /* DATAAQUISITION_H_ */
